Revit 2027 API
FabricationPart.PartGuid Property
 The fabrication part's globally unique identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Guid PartGuid { get; }
Public ReadOnly Property PartGuid As Guid
	Get
public:
property Guid PartGuid {
	Guid get ();
}
member PartGuid : Guid with get
Property Value
Guid
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace